app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    @artist = Artist.find_by(id: params[:artist_id])
    if @artist
      @songs = @artist.songs#.find_by(id: params[:artist_id]).songs
    elsif !params[:artist_id]
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    #@artist = Artist.find_by(id: params[:artist_id])
    #binding.pry
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist
        @song = @artist.songs.find_by(id: params[:id])